plcexpert/plc-x-arduino-hardware/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

###################   ATMEL AVR   ##################################
menu.module=Product
PLCAVR.name= PLC-EXPERT (AVR)

PLCAVR.bootloader.tool=avrdude
PLCAVR.build.core=arduino
PLCAVR.build.board=AVR_UNO
PLCAVR.upload.tool=avrdude
PLCAVR.upload.protocol=arduino



## Atmel 328P
## -------------------------------------------------
PLCAVR.menu.module.ATMEL328P_8MHZ=* Atmel Mega328P (8Mhz)
PLCAVR.menu.module.ATMEL328P_8MHZ.bootloader.high_fuses=0xD6
PLCAVR.menu.module.ATMEL328P_8MHZ.bootloader.low_fuses=0xFF
PLCAVR.menu.module.ATMEL328P_8MHZ.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.ATMEL328P_8MHZ.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.ATMEL328P_8MHZ.bootloader.lock_bits=0xCF
PLCAVR.menu.module.ATMEL328P_8MHZ.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex

PLCAVR.menu.module.ATMEL328P_8MHZ.build.mcu=atmega328p
PLCAVR.menu.module.ATMEL328P_8MHZ.build.f_cpu=8000000L
PLCAVR.menu.module.ATMEL328P_8MHZ.build.variant=atmega328p
PLCAVR.menu.module.ATMEL328P_8MHZ.build.board=AVR_UNO

PLCAVR.menu.module.ATMEL328P_8MHZ.upload.maximum_size=32256
PLCAVR.menu.module.ATMEL328P_8MHZ.upload.maximum_data_size=2048
PLCAVR.menu.module.ATMEL328P_8MHZ.upload.speed=57600

## Atmel 328P
## -------------------------------------------------
PLCAVR.menu.module.ATMEL328P_16MHZ=* Atmel Mega328P (16Mhz)

PLCAVR.menu.module.ATMEL328P_16MHZ.bootloader.high_fuses=0xD6
PLCAVR.menu.module.ATMEL328P_16MHZ.bootloader.low_fuses=0xFF
PLCAVR.menu.module.ATMEL328P_16MHZ.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.ATMEL328P_16MHZ.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.ATMEL328P_16MHZ.bootloader.lock_bits=0xCF
PLCAVR.menu.module.ATMEL328P_16MHZ.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.ATMEL328P_16MHZ.build.mcu=atmega328p
PLCAVR.menu.module.ATMEL328P_16MHZ.build.f_cpu=16000000L
PLCAVR.menu.module.ATMEL328P_16MHZ.build.variant=atmega328p
PLCAVR.menu.module.ATMEL328P_16MHZ.build.board=AVR_UNO

PLCAVR.menu.module.ATMEL328P_16MHZ.upload.maximum_size=32256
PLCAVR.menu.module.ATMEL328P_16MHZ.upload.maximum_data_size=2048
PLCAVR.menu.module.ATMEL328P_16MHZ.upload.speed=57600

## Atmel 328P
## -------------------------------------------------
PLCAVR.menu.module.ATMEL328P_20MHZ=* Atmel Mega328P (20Mhz)

PLCAVR.menu.module.ATMEL328P_20MHZ.bootloader.high_fuses=0xD6
PLCAVR.menu.module.ATMEL328P_20MHZ.bootloader.low_fuses=0xFF
PLCAVR.menu.module.ATMEL328P_20MHZ.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.ATMEL328P_20MHZ.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.ATMEL328P_20MHZ.bootloader.lock_bits=0xCF
PLCAVR.menu.module.ATMEL328P_20MHZ.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.ATMEL328P_20MHZ.build.mcu=atmega328p
PLCAVR.menu.module.ATMEL328P_20MHZ.build.f_cpu=20000000L
PLCAVR.menu.module.ATMEL328P_20MHZ.build.variant=atmega328p
PLCAVR.menu.module.ATMEL328P_20MHZ.build.board=AVR_UNO

PLCAVR.menu.module.ATMEL328P_20MHZ.upload.maximum_size=32256
PLCAVR.menu.module.ATMEL328P_20MHZ.upload.maximum_data_size=2048
PLCAVR.menu.module.ATMEL328P_20MHZ.upload.speed=57600

## Atmel 328PB
## -------------------------------------------------
PLCAVR.menu.module.ATMEL328PB_8MHZ=* Atmel Mega328PB (8Mhz)

PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.high_fuses=0xD6
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.low_fuses=0xFF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.lock_bits=0xCF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.ATMEL328PB_8MHZ.build.mcu=ATmega328PB
PLCAVR.menu.module.ATMEL328PB_8MHZ.build.f_cpu=8000000L
PLCAVR.menu.module.ATMEL328PB_8MHZ.build.variant=atmega328pb
PLCAVR.menu.module.ATMEL328PB_8MHZ.build.board=AVR_UNO

PLCAVR.menu.module.ATMEL328PB_8MHZ.upload.maximum_size=32256
PLCAVR.menu.module.ATMEL328PB_8MHZ.upload.maximum_data_size=2048
PLCAVR.menu.module.ATMEL328PB_8MHZ.upload.speed=57600

## Atmel 328PB
## -------------------------------------------------
PLCAVR.menu.module.ATMEL328PB_16MHZ=* Atmel Mega328PB (16Mhz)

PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.high_fuses=0xD6
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.low_fuses=0xFF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.lock_bits=0xCF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.ATMEL328PB_16MHZ.build.mcu=ATmega328PB
PLCAVR.menu.module.ATMEL328PB_16MHZ.build.f_cpu=16000000L
PLCAVR.menu.module.ATMEL328PB_16MHZ.build.variant=atmega328pb
PLCAVR.menu.module.ATMEL328PB_16MHZ.build.board=AVR_UNO

PLCAVR.menu.module.ATMEL328PB_16MHZ.upload.maximum_size=32256
PLCAVR.menu.module.ATMEL328PB_16MHZ.upload.maximum_data_size=2048
PLCAVR.menu.module.ATMEL328PB_16MHZ.upload.speed=57600

## Atmel 328PB
## -------------------------------------------------
PLCAVR.menu.module.ATMEL328PB_20MHZ=* Atmel Mega328PB (20Mhz)

PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.high_fuses=0xD6
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.low_fuses=0xFF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.lock_bits=0xCF
PLCAVR.menu.module.ATMEL328PB_8MHZ.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.ATMEL328PB_20MHZ.build.mcu=ATmega328PB
PLCAVR.menu.module.ATMEL328PB_20MHZ.build.f_cpu=20000000L
PLCAVR.menu.module.ATMEL328PB_20MHZ.build.variant=atmega328pb
PLCAVR.menu.module.ATMEL328PB_20MHZ.build.board=AVR_UNO

PLCAVR.menu.module.ATMEL328PB_20MHZ.upload.maximum_size=32256
PLCAVR.menu.module.ATMEL328PB_20MHZ.upload.maximum_data_size=2048
PLCAVR.menu.module.ATMEL328PB_20MHZ.upload.speed=57600

## AT TINY85
## -------------------------------------------------
PLCAVR.menu.module.ATTINY85=* AtTiny85 (internal 16Mhz)

PLCAVR.menu.module.ATTINY85.bootloader.high_fuses=0xDF
PLCAVR.menu.module.ATTINY85.bootloader.low_fuses=0xF1
PLCAVR.menu.module.ATTINY85.bootloader.extended_fuses=0xFF
PLCAVR.menu.module.ATTINY85.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.ATTINY85.bootloader.lock_bits=0xFF
PLCAVR.menu.module.ATTINY85.bootloader.file=attiny85.hex
PLCAVR.menu.module.ATTINY85.bootloader.tool=arduino:avrdude

