plcexpert/plc-x-arduino-hardware/avr/boards.txt
PLCAVR.menu.module.ATTINY85.build.core=digistump:tiny
PLCAVR.menu.module.ATTINY85.build.mcu=attiny85
PLCAVR.menu.module.ATTINY85.build.f_cpu=16000000L
PLCAVR.menu.module.ATTINY85.build.variant=tiny85
PLCAVR.menu.module.ATTINY85.build.board=attiny

PLCAVR.menu.module.ATTINY85.upload.maximum_size=8192
PLCAVR.menu.module.ATTINY85.upload.maximum_data_size=512
PLCAVR.menu.module.ATTINY85.upload.tool=micronucleus
PLCAVR.menu.module.ATTINY85.upload.protocol=usb
PLCAVR.menu.module.ATTINY85.upload.wait_for_upload_port=false
PLCAVR.menu.module.ATTINY85.upload.use_1200bps_touch=false
PLCAVR.menu.module.ATTINY85.upload.disable_flushing=false

PLCAVR.menu.module.ATTINY85.msg.info=Press Reset when Uploading is shown.
PLCAVR.menu.module.ATTINY85.vid.0=0x16D0
PLCAVR.menu.module.ATTINY85.pid.0=0x0753

## AT MEGA2560
## -------------------------------------------------
PLCAVR.menu.module.MEGA2560_16MHZ=* Atmel Mega2560 (16Mhz)

PLCAVR.menu.module.MEGA2560_16MHZ.bootloader.tool=avrdude
PLCAVR.menu.module.MEGA2560_16MHZ.bootloader.low_fuses=0xFF
PLCAVR.menu.module.MEGA2560_16MHZ.bootloader.unlock_bits=0x3F
PLCAVR.menu.module.MEGA2560_16MHZ.bootloader.lock_bits=0x0F
PLCAVR.menu.module.MEGA2560_16MHZ.bootloader.high_fuses=0xD8
PLCAVR.menu.module.MEGA2560_16MHZ.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.MEGA2560_16MHZ.bootloader.file=stk500boot_v2_mega2560.hex

PLCAVR.menu.module.MEGA2560_16MHZ.build.f_cpu=16000000L
PLCAVR.menu.module.MEGA2560_16MHZ.build.core=arduino
PLCAVR.menu.module.MEGA2560_16MHZ.build.variant=mega
PLCAVR.menu.module.MEGA2560_16MHZ.build.board=AVR_MEGA2560
PLCAVR.menu.module.MEGA2560_16MHZ.build.mcu=atmega2560

PLCAVR.menu.module.MEGA2560_16MHZ.upload.maximum_data_size=8192
PLCAVR.menu.module.MEGA2560_16MHZ.upload.protocol=wiring
PLCAVR.menu.module.MEGA2560_16MHZ.upload.maximum_size=253952
PLCAVR.menu.module.MEGA2560_16MHZ.upload.speed=115200

PLCAVR.menu.module.MEGA2560_16MHZ.vid.0=0x2341
PLCAVR.menu.module.MEGA2560_16MHZ.pid.0=0x0010
PLCAVR.menu.module.MEGA2560_16MHZ.vid.1=0x2341
PLCAVR.menu.module.MEGA2560_16MHZ.pid.1=0x0042
PLCAVR.menu.module.MEGA2560_16MHZ.vid.2=0x2A03
PLCAVR.menu.module.MEGA2560_16MHZ.pid.2=0x0010
PLCAVR.menu.module.MEGA2560_16MHZ.vid.3=0x2A03
PLCAVR.menu.module.MEGA2560_16MHZ.pid.3=0x0042
PLCAVR.menu.module.MEGA2560_16MHZ.vid.4=0x2341
PLCAVR.menu.module.MEGA2560_16MHZ.pid.4=0x0210
PLCAVR.menu.module.MEGA2560_16MHZ.vid.5=0x2341
PLCAVR.menu.module.MEGA2560_16MHZ.pid.5=0x0242

## AT MEGA2560
## -------------------------------------------------
PLCAVR.menu.module.MEGA2560_20MHZ=* Atmel Mega2560 (20Mhz)

PLCAVR.menu.module.MEGA2560_20MHZ.bootloader.tool=avrdude
PLCAVR.menu.module.MEGA2560_20MHZ.bootloader.low_fuses=0xFF
PLCAVR.menu.module.MEGA2560_20MHZ.bootloader.unlock_bits=0x3F
PLCAVR.menu.module.MEGA2560_20MHZ.bootloader.lock_bits=0x0F
PLCAVR.menu.module.MEGA2560_20MHZ.bootloader.high_fuses=0xD8
PLCAVR.menu.module.MEGA2560_20MHZ.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.MEGA2560_20MHZ.bootloader.file=stk500boot_v2_mega2560.hex

PLCAVR.menu.module.MEGA2560_20MHZ.build.f_cpu=20000000L
PLCAVR.menu.module.MEGA2560_20MHZ.build.core=arduino
PLCAVR.menu.module.MEGA2560_20MHZ.build.variant=mega
PLCAVR.menu.module.MEGA2560_20MHZ.build.board=AVR_MEGA2560
PLCAVR.menu.module.MEGA2560_20MHZ.build.mcu=atmega2560

PLCAVR.menu.module.MEGA2560_20MHZ.upload.maximum_data_size=8192
PLCAVR.menu.module.MEGA2560_20MHZ.upload.protocol=wiring
PLCAVR.menu.module.MEGA2560_20MHZ.upload.maximum_size=253952
PLCAVR.menu.module.MEGA2560_20MHZ.upload.speed=115200

PLCAVR.menu.module.MEGA2560_20MHZ.vid.0=0x2341
PLCAVR.menu.module.MEGA2560_20MHZ.pid.0=0x0010
PLCAVR.menu.module.MEGA2560_20MHZ.vid.1=0x2341
PLCAVR.menu.module.MEGA2560_20MHZ.pid.1=0x0042
PLCAVR.menu.module.MEGA2560_20MHZ.vid.2=0x2A03
PLCAVR.menu.module.MEGA2560_20MHZ.pid.2=0x0010
PLCAVR.menu.module.MEGA2560_20MHZ.vid.3=0x2A03
PLCAVR.menu.module.MEGA2560_20MHZ.pid.3=0x0042
PLCAVR.menu.module.MEGA2560_20MHZ.vid.4=0x2341
PLCAVR.menu.module.MEGA2560_20MHZ.pid.4=0x0210
PLCAVR.menu.module.MEGA2560_20MHZ.vid.5=0x2341
PLCAVR.menu.module.MEGA2560_20MHZ.pid.5=0x0242

## -------------------- PRODUCTS --------------------

## DIO - Digital Input/Ouput Arduino UNO shield
## -------------------------------------------------
PLCAVR.menu.module.DIO13=PLC-DIO 1.3 (Arduino UNO shield)

PLCAVR.menu.module.DIO13.bootloader.high_fuses=0xD6
PLCAVR.menu.module.DIO13.bootloader.low_fuses=0xFF
PLCAVR.menu.module.DIO13.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.DIO13.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.DIO13.bootloader.lock_bits=0xCF
PLCAVR.menu.module.DIO13.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.DIO13.build.mcu=atmega328p
PLCAVR.menu.module.DIO13.build.f_cpu=16000000L
PLCAVR.menu.module.DIO13.build.variant=atmega328p
PLCAVR.menu.module.DIO13.build.board=AVR_UNO

PLCAVR.menu.module.DIO13.upload.maximum_size=32256
PLCAVR.menu.module.DIO13.upload.maximum_data_size=2048
PLCAVR.menu.module.DIO13.upload.speed=57600

## DIO - Digital Input/Ouput Arduino NANO shield 
## -------------------------------------------------
PLCAVR.menu.module.DIO14=PLC-DIO 1.4 (Arduino NANO shield)

PLCAVR.menu.module.DIO14.bootloader.high_fuses=0xD6
PLCAVR.menu.module.DIO14.bootloader.low_fuses=0xFF
PLCAVR.menu.module.DIO14.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.DIO14.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.DIO14.bootloader.lock_bits=0xCF
PLCAVR.menu.module.DIO14.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.DIO14.build.mcu=atmega328p
PLCAVR.menu.module.DIO14.build.f_cpu=16000000L
PLCAVR.menu.module.DIO14.build.variant=atmega328p
PLCAVR.menu.module.DIO14.build.board=AVR_UNO

PLCAVR.menu.module.DIO14.upload.maximum_size=32256
PLCAVR.menu.module.DIO14.upload.maximum_data_size=2048
PLCAVR.menu.module.DIO14.upload.speed=57600

## Plc-Micro 1.3
## -------------------------------------------------
PLCAVR.menu.module.MICRO13=PLC-Micro 1.3

PLCAVR.menu.module.MICRO13.bootloader.high_fuses=0xD6
PLCAVR.menu.module.MICRO13.bootloader.low_fuses=0xFF
PLCAVR.menu.module.MICRO13.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.MICRO13.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.MICRO13.bootloader.lock_bits=0xCF
PLCAVR.menu.module.MICRO13.bootloader.file=optiboot_m328pb.hex

